## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "acrbleudev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-bleu-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.bleu will be created
  + resource "azurerm_key_vault" "bleu" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Delete",
                ]
              + object_id          = "861010ac-21ae-4da1-a0f8-34326adcfc02"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                ]
              + tenant_id          = "4e4151dc-0232-4e6b-9f24-5c0ecf5abc33"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-bleu-dev"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-bleu-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + tenant_id                     = "4e4151dc-0232-4e6b-9f24-5c0ecf5abc33"
      + vault_uri                     = (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgresql-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_kubernetes_cluster.bleu will be created
  + resource "azurerm_kubernetes_cluster" "bleu" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "bleu-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.28.3"
      + location                            = "eastus"
      + name                                = "aks-bleu-dev"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-bleu-dev"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip     = "10.2.0.10"
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.2.0.0/16"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_log_analytics_workspace.bleu will be created
  + resource "azurerm_log_analytics_workspace" "bleu" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "log-bleu-dev"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-bleu-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_postgresql_flexible_server.bleu will be created
  + resource "azurerm_postgresql_flexible_server" "bleu" {
      + administrator_login           = "bleuadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "psql-bleu-dev"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "rg-bleu-dev"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + version                       = "14"
      + zone                          = "1"

      + authentication (known after apply)
    }

  # azurerm_postgresql_flexible_server_database.bleu will be created
  + resource "azurerm_postgresql_flexible_server_database" "bleu" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "bleu_db"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.allow_azure_services will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "allow_azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_resource_group.bleu will be created
  + resource "azurerm_resource_group" "bleu" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-bleu-dev"
      + tags     = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                               = [
          + "10.0.0.0/20",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-aks-dev"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-bleu-dev"
      + virtual_network_name                           = "vnet-bleu-dev"
    }

  # azurerm_subnet.app_gateway will be created
  + resource "azurerm_subnet" "app_gateway" {
      + address_prefixes                               = [
          + "10.0.16.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-appgw-dev"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-bleu-dev"
      + virtual_network_name                           = "vnet-bleu-dev"
    }

  # azurerm_subnet.db will be created
  + resource "azurerm_subnet" "db" {
      + address_prefixes                               = [
          + "10.0.17.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-db-dev"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-bleu-dev"
      + service_endpoints                              = [
          + "Microsoft.Sql",
        ]
      + virtual_network_name                           = "vnet-bleu-dev"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_virtual_network.bleu will be created
  + resource "azurerm_virtual_network" "bleu" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-bleu-dev"
      + resource_group_name = "rg-bleu-dev"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server                = (known after apply)
  + aks_kube_config                 = (sensitive value)
  + postgresql_server_fqdn          = (known after apply)
```
</details>